'''
딕셔너리 활용 방법법
b = {1 : '정신력', 2 : '드랍찬스', 3 : '글로벌디팬스', 4 : '모든저항', 5 : '최대마나', 6 : '최대생명력', 7 : '모든 능력치'}
b2 = b[1], b[2]
b3 = b[1], b[3]
b4 = b[1], b[5]
b5 = b[1], b[6]
c1 = b[2], b[3]
c2 = b[2], b[5]
c3 = b[2], b[6]
d1 = b[3], b[5]
d2 = b[3], b[6]
e1 = b[5], b[6]
e2 = b[4], b[1]
e3 = b[4], b[2]
e4 = b[4], b[3]
e5 = b[4], b[5]
e6 = b[4], b[6]
f1 = b[7], b[1]
f2 = b[7], b[2]
f3 = b[7], b[3]
f4 = b[7], b[5]
f5 = b[7], b[6]
x = b[4], b[7]
m2 = [b2, b3, b4, b5, c1, c2, c3, d1, d2, e1, e2, e3, e4, e5, e6, f1, f2, f3, f4, f5]
m1 = [x]
print(m2)
'''